ds-1-2-soap/requestorder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://foodmenu.io/cs/webservice">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:addOrderRequest>
            <gs:order>
                <gs:address>Knapenhoef</gs:address>
                <gs:meals>[Steak, Portobello]</gs:meals>
            </gs:order>
        </gs:addOrderRequest>
    </soapenv:Body>
</soapenv:Envelope>